# Preprocessing Workflow

In [1]:
#Investigate the dataset step by step, feature by feature and take preprocessing decisions

In [2]:
import pandas as pd
import numpy as np

## Train Dataset

In [3]:
#DataFrame train set
data_train = pd.read_csv("/Users/farahboukitab/code/mrdaraujo/business_case_869/business_case_869/data/store-sales-time-series-forecasting/train.csv")
pd.DataFrame(data_train)
#data_test = data[data["date"]=="2013-01-01"]
#data_test['store_nbr'].sum()

,id,date,store_nbr,family,sales,onpromotion
0,0,2013-01-01,1,AUTOMOTIVE,0.000,0
1,1,2013-01-01,1,BABY CARE,0.000,0
2,2,2013-01-01,1,BEAUTY,0.000,0
3,3,2013-01-01,1,BEVERAGES,0.000,0
4,4,2013-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
3000883,3000883,2017-08-15,9,POULTRY,438.133,0
3000884,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
3000885,3000885,2017-08-15,9,PRODUCE,2419.729,148
3000886,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
3000887,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [4]:
data_train.nunique()

id             3000888
date              1684
store_nbr           54
family              33
sales           379610
onpromotion        362
dtype: int64

## Transactions Dataset

In [5]:
data_transactions = pd.read_csv("/Users/farahboukitab/code/mrdaraujo/business_case_869/business_case_869/data/store-sales-time-series-forecasting/transactions.csv")
pd.DataFrame(data_transactions)

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [6]:
len(data_transactions)

83488

In [7]:
data_transactions.nunique()

date            1682
store_nbr         54
transactions    4993
dtype: int64

## Stores Dataset

In [8]:
data_stores = pd.read_csv("/Users/farahboukitab/code/mrdaraujo/business_case_869/business_case_869/data/store-sales-time-series-forecasting/stores.csv")
pd.DataFrame(data_stores)

    store_nbr           city                           state type  cluster
0           1          Quito                       Pichincha    D       13
1           2          Quito                       Pichincha    D       13
2           3          Quito                       Pichincha    D        8
3           4          Quito                       Pichincha    D        9
4           5  Santo Domingo  Santo Domingo de los Tsachilas    D        4
5           6          Quito                       Pichincha    D       13
6           7          Quito                       Pichincha    D        8
7           8          Quito                       Pichincha    D        8
8           9          Quito                       Pichincha    B        6
9          10          Quito                       Pichincha    C       15
10         11        Cayambe                       Pichincha    B        6
11         12      Latacunga                        Cotopaxi    C       15
12         13      Latacunga                        Cotopaxi    C       15
13         14       Riobamba                      Chimborazo    C        7
14         15         Ibarra                        Imbabura    C       15
15         16  Santo Domingo  Santo Domingo de los Tsachilas    C        3
16         17          Quito                       Pichincha    C       12
17         18          Quito                       Pichincha    B       16
18         19       Guaranda                         Bolivar    C       15
19         20          Quito                       Pichincha    B        6
20         21  Santo Domingo  Santo Domingo de los Tsachilas    B        6
21         22           Puyo                         Pastaza    C        7
22         23         Ambato                      Tungurahua    D        9
23         24      Guayaquil                          Guayas    D        1
24         25        Salinas                     Santa Elena    D        1
25         26      Guayaquil                          Guayas    D       10
26         27          Daule                          Guayas    D        1
27         28      Guayaquil                          Guayas    E       10
28         29      Guayaquil                          Guayas    E       10
29         30      Guayaquil                          Guayas    C        3
30         31       Babahoyo                        Los Rios    B       10
31         32      Guayaquil                          Guayas    C        3
32         33        Quevedo                        Los Rios    C        3
33         34      Guayaquil                          Guayas    B        6
34         35         Playas                          Guayas    C        3
35         36       Libertad                          Guayas    E       10
36         37         Cuenca                           Azuay    D        2
37         38           Loja                            Loja    D        4
38         39         Cuenca                           Azuay    B        6
39         40        Machala                          El Oro    C        3
40         41        Machala                          El Oro    D        4
41         42         Cuenca                           Azuay    D        2
42         43     Esmeraldas                      Esmeraldas    E       10
43         44          Quito                       Pichincha    A        5
44         45          Quito                       Pichincha    A       11
45         46          Quito                       Pichincha    A       14
46         47          Quito                       Pichincha    A       14
47         48          Quito                       Pichincha    A       14
48         49          Quito                       Pichincha    A       11
49         50         Ambato                      Tungurahua    A       14
50         51      Guayaquil                          Guayas    A       17
51         52          Manta                          Manabi    A       11
52         53          Manta                          Manabi    D       13
53         54      El Carmen                          Manabi    C        3

In [9]:
data_stores.nunique()

store_nbr    54
city         22
state        16
type          5
cluster      17
dtype: int64

## Merge Dataset with transactions Dataset and Store Dataset

In [10]:
#Create Dataframe with merge transactions and stores based on the store number
dataframe_merged = pd.merge(data_transactions, data_stores, on="store_nbr")
pd.DataFrame(dataframe_merged)

             date  store_nbr  transactions     city        state type  cluster
0      2013-01-01         25           770  Salinas  Santa Elena    D        1
1      2013-01-02         25          1038  Salinas  Santa Elena    D        1
2      2013-01-03         25           887  Salinas  Santa Elena    D        1
3      2013-01-04         25          1054  Salinas  Santa Elena    D        1
4      2013-01-05         25          1355  Salinas  Santa Elena    D        1
...           ...        ...           ...      ...          ...  ...      ...
83483  2017-08-11         52          2957    Manta       Manabi    A       11
83484  2017-08-12         52          2804    Manta       Manabi    A       11
83485  2017-08-13         52          2433    Manta       Manabi    A       11
83486  2017-08-14         52          2074    Manta       Manabi    A       11
83487  2017-08-15         52          2255    Manta       Manabi    A       11

[83488 rows x 7 columns]

In [11]:
dataframe_merged.nunique()

date            1682
store_nbr         54
transactions    4993
city              22
state             16
type               5
cluster           17
dtype: int64

## Oil Dataset

In [12]:
data_oil = pd.read_csv("/Users/farahboukitab/code/mrdaraujo/business_case_869/business_case_869/data/store-sales-time-series-forecasting/oil.csv")
pd.DataFrame(data_oil)

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [13]:
data_oil.nunique()

date          1218
dcoilwtico     998
dtype: int64

In [14]:
data_oil.dtypes

date           object
dcoilwtico    float64
dtype: object

In [15]:
data_oil.isna().sum()

date           0
dcoilwtico    43
dtype: int64

## Merge Oil Price with the transactions and stores dataframe

In [16]:
dataframe_merged_OilTransacStores = pd.merge(dataframe_merged, data_oil, on="date",how = "left")
pd.DataFrame(dataframe_merged_OilTransacStores)

,date,store_nbr,transactions,city,state,type,cluster,dcoilwtico
0,2013-01-01,25,770,Salinas,Santa Elena,D,1,NaN
1,2013-01-02,25,1038,Salinas,Santa Elena,D,1,93.14
2,2013-01-03,25,887,Salinas,Santa Elena,D,1,92.97
3,2013-01-04,25,1054,Salinas,Santa Elena,D,1,93.12
4,2013-01-05,25,1355,Salinas,Santa Elena,D,1,NaN
...,...,...,...,...,...,...,...,...
83483,2017-08-11,52,2957,Manta,Manabi,A,11,48.81
83484,2017-08-12,52,2804,Manta,Manabi,A,11,NaN
83485,2017-08-13,52,2433,Manta,Manabi,A,11,NaN
83486,2017-08-14,52,2074,Manta,Manabi,A,11,47.59
83487,2017-08-15,52,2255,Manta,Manabi,A,11,47.57

## Create a DataFrame to analyze days with NaN values

In [17]:
dataframe_NonOilValue = data_oil[data_oil["dcoilwtico"].isna()]
dataframe_NonOilValue

            date  dcoilwtico
0     2013-01-01         NaN
14    2013-01-21         NaN
34    2013-02-18         NaN
63    2013-03-29         NaN
104   2013-05-27         NaN
132   2013-07-04         NaN
174   2013-09-02         NaN
237   2013-11-28         NaN
256   2013-12-25         NaN
261   2014-01-01         NaN
274   2014-01-20         NaN
294   2014-02-17         NaN
338   2014-04-18         NaN
364   2014-05-26         NaN
393   2014-07-04         NaN
434   2014-09-01         NaN
497   2014-11-27         NaN
517   2014-12-25         NaN
522   2015-01-01         NaN
534   2015-01-19         NaN
554   2015-02-16         NaN
588   2015-04-03         NaN
624   2015-05-25         NaN
653   2015-07-03         NaN
699   2015-09-07         NaN
757   2015-11-26         NaN
778   2015-12-25         NaN
783   2016-01-01         NaN
794   2016-01-18         NaN
814   2016-02-15         NaN
843   2016-03-25         NaN
889   2016-05-30         NaN
914   2016-07-04         NaN
959   2016-09-05         NaN
1017  2016-11-24         NaN
1039  2016-12-26         NaN
1044  2017-01-02         NaN
1054  2017-01-16         NaN
1079  2017-02-20         NaN
1118  2017-04-14         NaN
1149  2017-05-29         NaN
1174  2017-07-03         NaN
1175  2017-07-04         NaN

In [18]:
dataframe_NonOilValue.count()

date          43
dcoilwtico     0
dtype: int64

## Holidays Dataset

In [19]:
data_holidays = pd.read_csv("/Users/farahboukitab/code/mrdaraujo/business_case_869/business_case_869/data/store-sales-time-series-forecasting/holidays_events.csv")
pd.DataFrame(data_holidays)

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False
...,...,...,...,...,...,...
345,2017-12-22,Additional,National,Ecuador,Navidad-3,False
346,2017-12-23,Additional,National,Ecuador,Navidad-2,False
347,2017-12-24,Additional,National,Ecuador,Navidad-1,False
348,2017-12-25,Holiday,National,Ecuador,Navidad,False
349,2017-12-26,Additional,National,Ecuador,Navidad+1,False

In [20]:
len(data_holidays)

350

In [21]:
data_holidays.nunique()

date           312
type             6
locale           3
locale_name     24
description    103
transferred      2
dtype: int64

In [22]:
DataFrame_duplicate = pd.DataFrame(data_holidays['date'].value_counts()>1)
DataFrame_duplicate = DataFrame_duplicate.reset_index()
DataFrame_duplicate.rename(columns={'index': 'date', 'date': 'bool'}, inplace=True)
DataFrame_duplicate

           date   bool
0    2014-06-25   True
1    2017-06-25   True
2    2016-06-25   True
3    2015-06-25   True
4    2013-06-25   True
..          ...    ...
307  2014-07-13  False
308  2014-07-12  False
309  2014-07-09  False
310  2014-07-08  False
311  2017-12-26  False

[312 rows x 2 columns]

In [23]:
DataFrame_duplicate[DataFrame_duplicate['bool']==False].count()

date    281
bool    281
dtype: int64

In [24]:
DataFrame_duplicate[DataFrame_duplicate['bool']==True].count()

date    31
bool    31
dtype: int64

In [25]:
DataFrame_duplicate_2 = DataFrame_duplicate[DataFrame_duplicate['bool']==True]
DataFrame_duplicate_2

          date  bool
0   2014-06-25  True
1   2017-06-25  True
2   2016-06-25  True
3   2015-06-25  True
4   2013-06-25  True
5   2012-06-25  True
6   2014-12-26  True
7   2015-12-22  True
8   2012-12-22  True
9   2012-12-24  True
10  2017-07-03  True
11  2012-12-31  True
12  2016-05-01  True
13  2014-12-22  True
14  2016-11-12  True
15  2013-12-22  True
16  2017-04-14  True
17  2016-12-22  True
18  2013-05-12  True
19  2013-07-03  True
20  2014-07-03  True
21  2016-04-21  True
22  2016-05-07  True
23  2016-07-03  True
24  2016-07-24  True
25  2016-05-12  True
26  2017-12-08  True
27  2012-07-03  True
28  2016-05-08  True
29  2017-12-22  True
30  2015-07-03  True

In [26]:
## select on data holidays only duplicate days

In [27]:
DataFrame_HolidaysDuplicate = pd.merge(DataFrame_duplicate_2, data_holidays, on="date")
DataFrame_HolidaysDuplicate

,date,bool,type,locale,locale_name,description,transferred
0,2014-06-25,True,Holiday,Local,Latacunga,Cantonizacion de Latacunga,False
1,2014-06-25,True,Holiday,Local,Machala,Fundacion de Machala,False
2,2014-06-25,True,Holiday,Regional,Imbabura,Provincializacion de Imbabura,False
3,2014-06-25,True,Event,National,Ecuador,Mundial de futbol Brasil: Ecuador-Francia,False
4,2017-06-25,True,Holiday,Regional,Imbabura,Provincializacion de Imbabura,False
...,...,...,...,...,...,...,...
64,2016-05-08,True,Event,National,Ecuador,Dia de la Madre,False
65,2017-12-22,True,Holiday,Local,Salinas,Cantonizacion de Salinas,False
66,2017-12-22,True,Additional,National,Ecuador,Navidad-3,False
67,2015-07-03,True,Holiday,Local,El Carmen,Cantonizacion de El Carmen,False
68,2015-07-03,True,Holiday,Local,Santo Domingo,Fundacion de Santo Domingo,False

In [28]:
data_holidays.dtypes

date           object
type           object
locale         object
locale_name    object
description    object
transferred      bool
dtype: object

In [29]:
data_holidays.isna().sum()

date           0
type           0
locale         0
locale_name    0
description    0
transferred    0
dtype: int64

In [30]:
data_holidays_duplicate = pd.DataFrame(data_holidays['date'].value_counts()<1)
#data_holidays_duplicate = pd.DataFrame(data_holidays['date'].value_counts()>1).reset_index()
#data_holidays_duplicate.rename(columns={'index': 'date', 'date': 'bool'}, inplace=True)
#data_holidays_duplicate.sort_values(by=['date']).reset_index(drop=True)
#data_holidays_duplicate

In [31]:
data_holidays_duplicate

             date
2014-06-25  False
2017-06-25  False
2016-06-25  False
2015-06-25  False
2013-06-25  False
...           ...
2014-07-13  False
2014-07-12  False
2014-07-09  False
2014-07-08  False
2017-12-26  False

[312 rows x 1 columns]

In [32]:
data_holidays['date'].value_counts()

2014-06-25    4
2017-06-25    3
2016-06-25    3
2015-06-25    3
2013-06-25    3
             ..
2014-07-13    1
2014-07-12    1
2014-07-09    1
2014-07-08    1
2017-12-26    1
Name: date, Length: 312, dtype: int64

In [33]:
data_holidays['date'].value_counts() == 1

2014-06-25    False
2017-06-25    False
2016-06-25    False
2015-06-25    False
2013-06-25    False
              ...
2014-07-13     True
2014-07-12     True
2014-07-09     True
2014-07-08     True
2017-12-26     True
Name: date, Length: 312, dtype: bool

In [34]:
data_sample = pd.read_csv("/Users/farahboukitab/code/mrdaraujo/business_case_869/business_case_869/data/store-sales-time-series-forecasting/sample_submission.csv")
pd.DataFrame(data_sample)

            id  sales
0      3000888    0.0
1      3000889    0.0
2      3000890    0.0
3      3000891    0.0
4      3000892    0.0
...        ...    ...
28507  3029395    0.0
28508  3029396    0.0
28509  3029397    0.0
28510  3029398    0.0
28511  3029399    0.0

[28512 rows x 2 columns]

In [35]:
data_transaction = pd.read_csv("/Users/farahboukitab/code/mrdaraujo/business_case_869/business_case_869/data/store-sales-time-series-forecasting/sample_submission.csv")
pd.DataFrame(data_sample)

            id  sales
0      3000888    0.0
1      3000889    0.0
2      3000890    0.0
3      3000891    0.0
4      3000892    0.0
...        ...    ...
28507  3029395    0.0
28508  3029396    0.0
28509  3029397    0.0
28510  3029398    0.0
28511  3029399    0.0

[28512 rows x 2 columns]

## Duplicates

In [36]:
#locate and remove meaningless duplicate

In [37]:
#Define how many duplicated rows

###duplicate_count = len(data)-len(data.drop_duplicates()) # Original data length minus data length without duplicates
###duplicate_count

#data.drop_duplicates(inplace=True) # Drop duplicates in place

## Missing Data

In [38]:
#percentage of missing values for all columns

In [39]:
###data.isnull().sum().sort_values(ascending=False)/len(data) #NaN percentage for each column

In [40]:
#1 - Drop the column entirely
#2 - Replace the NaN with meaningful values
#3- Impute the column median using sklearn simple imputer

## Scaling

In [41]:
#investigate columns for distribution and outliers and choose the most appropriate scaling technique : Standard Scale
#Robust Scale, MinMax Scale